# ValueParsingOptions Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ValueParsingOptions Members
ValueParsingOptions Class Constructors Methods Properties See Also
---
The ValueParsingOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ValueParsingOptions | Creates a new ValueParsingOptions object with default settings. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ValueParsingOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetFormatOptions | Gets the FormatOptions to optionally override the default settings in the Units class. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetFormatOptions | Sets the FormatOptions to optionally override the default settings in the Units class. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllowedValues | The allowable range of values to be parsed. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ValueParsingOptions Class
Autodesk.Revit.DB Namespace